using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Aciident_Geo_Watch
{
    class Locations
    {
        static Dictionary<string, string> location = new Dictionary<string, string>
    {

{ "الإسكندرية", "الإسكندرية" },        
{ "الإسماعيلية", "الإسماعيلية" },        
{ "أسوان", "أسوان" },        
{ "أسيوط", "أسيوط" },        
{ "الأقصر", "الأقصر" },        
{ "البحر الأحمر", "البحر الأحمر" },        
{ "البحيرة", "البحيرة" },        
{ "بني سويف", "بني سويف" },        
{ "بورسعيد", "بورسعيد" },        
{ "جنوب سيناء", "جنوب سيناء" },        
{ "الجيزة", "الجيزة" },        
{ "الدقهلية", "الدقهلية" },        
{ "دمياط", "دمياط" },        
{ "سوهاج", "سوهاج" },        
{ "السويس", "السويس" },        
{ "الشرقية", "الشرقية" },        
{ "شمال سيناء", "شمال سيناء" },        
{ "الغربية", "الغربية" },        
{ "الفيوم", "الفيوم" },        
{ "القاهرة", "القاهرة" },        
{ "القليوبية", "القليوبية" },        
{ "قنا", "قنا" },        
{ "كفر الشيخ", "كفر الشيخ" },        
{ "مطروح", "مطروح" },        
{ "المنوفية", "المنوفية" },        
{ "المنيا", "المنيا" },        
{ "الوادي الجديد", "الوادي الجديد" },
{"الشيخ زايد","الشيخ زايد"},
{"الحوامدية","الحوامدية"},
{"البدرشين","البدرشين"},
{"الصف","الصف"},
{"أطفيح","أطفيح"},
{"العياط","العياط"},
{"الباويطي","الباويطي"},
{"منشأة القناطر","منشأة القناطر"},
{"أوسيم","أوسيم"},
{"كرداسة","كرداسة"},
{"أبو النمرس","أبو النمرس"},
{"كفر غطاطي","كفر غطاطي"},
{"منشأة البكاري","منشأة البكاري"},
{"بنها","بنها"},
{"قليوب","قليوب"},
{"شبرا الخيمة","شبرا الخيمة"},
{"القناطر الخيرية","القناطر الخيرية"},
{"الخانكة","الخانكة"},
{"كفر شكر","كفر شكر"},
{"طوخ","طوخ"},
{"قها","قها"},
{"العبور ","العبور "},
{"الخصوص ","الخصوص "},
{"شبين القناطر","شبين القناطر"},
{"برج العرب ","برج العرب "},
{"دمنهور","دمنهور"},
{"كفر الدوار","كفر الدوار"},
{"رشيد","رشيد"},
{"إدكو","إدكو"},
{"أبو المطامير","أبو المطامير"},
{"أبو حمص","أبو حمص"},
{"الدلنجات","الدلنجات"},
{"المحمودية","المحمودية"},
{"الرحمانية","الرحمانية"},
{"إيتاي البارود","إيتاي البارود"},
{"حوش عيسى","حوش عيسى"},
{"شبراخيت","شبراخيت"},
{"كوم حمادة","كوم حمادة"},
{"بدر","بدر"},
{"وادي النطرون","وادي النطرون"},
{"النوبارية","النوبارية"},
{"مرسى مطروح","مرسى مطروح"},
{"الحمام ","الحمام "},
{"العلمين","العلمين"},
{"الضبعة","الضبعة"},
{"النجيلة","النجيلة"},
{"سيدي براني","سيدي براني"},
{"السلوم","السلوم"},
{"سيوة","سيوة"},
{"رأس البر","رأس البر"},
{"فارسكور","فارسكور"},
{"كفر سعد","كفر سعد"},
{"الزرقا","الزرقا"},
{"السرو","السرو"},
{"الروضة","الروضة"},
{"كفر البطيخ","كفر البطيخ"},
{"عزبة البرج","عزبة البرج"},
{"ميت أبو غالب","ميت أبو غالب"},
{"المنصورة","المنصورة"},
{"طلخا","طلخا"},
{"ميت غمر","ميت غمر"},
{"دكرنس","دكرنس"},
{"أجا","أجا"},
{"منية النصر","منية النصر"},
{"السنبلاوين","السنبلاوين"},
{"الكردي","الكردي"},
{"بني عبيد","بني عبيد"},
{"المنزلة","المنزلة"},
{"تمي الأمديد","تمي الأمديد"},
{"الجمالية","الجمالية"},
{"شربين","شربين"},
{"المطرية","المطرية"},
{"بلقاس","بلقاس"},
{"ميت سلسيل","ميت سلسيل"},
{"جمصة","جمصة"},
{"محلة دمنة","محلة دمنة"},
{"نبروه","نبروه"},
{"دسوق","دسوق"},
{"فوه","فوه"},
{"مطوبس","مطوبس"},
{"بلطيم","بلطيم"},
{"الحامول","الحامول"},
{"بيلا","بيلا"},
{"سيدي سالم","سيدي سالم"},
{"قلين","قلين"},
{"سيدي غازي","سيدي غازي"},
{"برج البرلس","برج البرلس"},
{"طنطا","طنطا"},
{"المحلة الكبرى","المحلة الكبرى"},
{"المحلة","المحلة"},
{"كفر الزيات","كفر الزيات"},
{"زفتى","زفتى"},
{"السنطة","السنطة"},
{"قطور","قطور"},
{"بسيون","بسيون"},
{"بولاق","بولاق"},
{"سمنود","سمنود"},
{"شبين الكوم","شبين الكوم"},
{"مدينة السادات","مدينة السادات"},
{"مدينة نصر","مدينة نصر"},
{"منوف","منوف"},
{"سرس الليان","سرس الليان"},
{"أشمون","أشمون"},
{"الباجور","الباجور"},
{"قويسنا","قويسنا"},
{"بركة السبع","بركة السبع"},
{"تلا","تلا"},
{"الشهداء","الشهداء"},
{"الزقازيق","الزقازيق"},
{"العاشر من رمضان","العاشر من رمضان"},
{"منيا القمح","منيا القمح"},
{"بلبيس","بلبيس"},
{"مشتول السوق","مشتول السوق"},
{"القنايات","القنايات"},
{"أبو حماد","أبو حماد"},
{"القرين","القرين"},
{"ههيا","ههيا"},
{"أبو كبير","أبو كبير"},
{"فاقوس","فاقوس"},
{"الصالحية الجديدة","الصالحية الجديدة"},
{"الإبراهيمية","الإبراهيمية"},
{"ديرب نجم","ديرب نجم"},
{"كفر صقر","كفر صقر"},
{"الحسينية","الحسينية"},
{"بورفؤاد","بورفؤاد"},
{"فايد","فايد"},
{"القنطرة","القنطرة"},
{"التل الكبير","التل الكبير"},
{"أبو صوير المحطة","أبو صوير المحطة"},
{"القصاصين الجديدة","القصاصين الجديدة"},
{"العريش","العريش"},
{"الشيخ زويد","الشيخ زويد"},
{"رفح","رفح"},
{"بئر العبد","بئر العبد"},
{"الحسنة","الحسنة"},
{"نخل","نخل"},
{"الطور","الطور"},
{"شرم الشيخ","شرم الشيخ"},
{"دهب","دهب"},
{"نويبع","نويبع"},
{"طابا","طابا"},
{"سانت كاترين ","سانت كاترين "},
{"أبو رديس","أبو رديس"},
{"أبو زنيمة","أبو زنيمة"},
{"رأس سدر","رأس سدر"},
{"الواسطى","الواسطى"},
{"ناصر","ناصر"},
{"إهناسيا","إهناسيا"},
{"ببا","ببا"},
{"سمسطا","سمسطا"},
{"الفشن","الفشن"},
{"طامية","طامية"},
{"سنورس","سنورس"},
{"إطسا","إطسا"},
{"إبشواي","إبشواي"},
{"العدوة","العدوة"},
{"مغاغة","مغاغة"},
{"بني مزار","بني مزار"},
{"مطاي","مطاي"},
{"سمالوط","سمالوط"},
{"المدينة الفكرية","المدينة الفكرية"},
{"ملوي","ملوي"},
{"دير مواس","دير مواس"},
{"ديروط","ديروط"},
{"منفلوط","منفلوط"},
{"القوصية","القوصية"},
{"أبنوب","أبنوب"},
{"أبو تيج","أبو تيج"},
{"الغنايم","الغنايم"},
{"ساحل سليم","ساحل سليم"},
{"البداري","البداري"},
{"صدفا","صدفا"},
{"الخارجة","الخارجة"},
{"موط","موط"},
{"الفرافرة","الفرافرة"},
{"بلاط","بلاط"},
{"الغردقة","الغردقة"},
{"رأس غارب","رأس غارب"},
{"سفاجا","سفاجا"},
{"مرسى علم","مرسى علم"},
{"الشلاتين","الشلاتين"},
{"حلايب","حلايب"},
{"أخميم","أخميم"},
{"أخميم الجديدة","أخميم الجديدة"},
{"البلينا","البلينا"},
{"المراغة","المراغة"},
{"المنشأة","المنشأة"},
{"دار السلام","دار السلام"},
{"جرجا","جرجا"},
{"جهينة الغربية","جهينة الغربية"},
{"ساقلته","ساقلته"},
{"طما","طما"},
{"طهطا","طهطا"},
{"أبو تشت","أبو تشت"},
{"نجع حمادي","نجع حمادي"},
{"دشنا","دشنا"},
{"الوقف","الوقف"},
{"قفط","قفط"},
{"نقادة","نقادة"},
{"قوص","قوص"},
{"فرشوط","فرشوط"},
{"طيبة","طيبة"},
{"الزينية","الزينية"},
{"البياضية","البياضية"},
{"القرنة","القرنة"},
{"أرمنت","أرمنت"},
{"الطود ","الطود "},
{"إسنا","إسنا"},
{"دراو","دراو"},
{"كوم أمبو","كوم أمبو"},
{"نصر النوبة","نصر النوبة"},
{"كلابشة","كلابشة"},
{"إدفو","إدفو"},
{"الرديسية","الرديسية"},
{"البصيلية","البصيلية"},
{"السباعية","السباعية"},
{"أبو سمبل","أبو سمبل"},   
{"الهرم","الهرم"},        
{"العجوزة","العجوزة"},        
{"الوراق","الوراق"},        
{"القطامية","القطامية"},        
{"العجمي","العجمي"}, 
{"العامرية","العامرية"}, 
{"المنتزة","المنتزة"}, 
{"العمرانية","العمرانية"}, 
{"شبرا","شبرا"}, 
{"الزيتون","الزيتون"}, 
{"الزاوية الحمراء","الزاوية الحمراء"}, 
{"حدائق القبة","حدائق القبة"}, 
{"الشرابية","الشرابية"}, 
{"روض الفرج","روض الفرج"}, 
{"الأميرية","الأميرية"}, 
{"المرج","المرج"},        
{"عين شمس","عين شمس"},        
{"النزهة","النزهة"},        
{"مصر الجديدة","مصر الجديدة"},        
{" مدينة نصر"," مدينة نصر"},        
{"منشأة ناصر","منشأة ناصر"},        
{"باب الشعرية","باب الشعرية"},        
{"الأزبكية","الأزبكية"},  
{"الموسكي","الموسكي"},        
{"عابدين","عابدين"},        
{"المقطم","المقطم"},        
{"السيدة زينب","السيدة زينب"},        
{"مصر القديمة","مصر القديمة"},        
{"البساتين","البساتين"},
{"لمعادي","لمعادي"},    
{"طره","طره"},    
{"المعصرة","المعصرة"},    
{" حلوان"," حلوان"},            
{"التبين","التبين"},    
{"السادس من أكتوبر", "السادس من أكتوبر" }

};

        static char[] delimiters = new char[]
    {
        ' '
    };


        public static string get_location(string input)
        {
            var words = input.Split(delimiters,StringSplitOptions.RemoveEmptyEntries);
            
            String s="" ;

            String city = "none"; 
            foreach (string currentWord in words)
            {
                s +=currentWord;
                if (currentWord[0] == 'ب')
                {
                    if (location.ContainsKey(currentWord))
                    {
                        city = currentWord;
                        break;
                    }
                    String temp = currentWord.Substring(1);
                    if (location.ContainsKey(temp))
                    {
                        city = temp;
                        break;
                    }
                }
                else
                {
                    if (location.ContainsKey(currentWord))
                    {
                        city = currentWord;
                        break;
                    }
 
                }

                String[] temp_words = s.Split(' ');
                if(temp_words.Count()==2)
                {
                    if (location.ContainsKey(s))
                    {
                        city = s;
                        break;
                    }

                    if (s[0] == 'ب')
                    {
                        String temp = s.Substring(1);
                        if (location.ContainsKey(temp))
                        {
                            city = temp;
                            break;
                        }
                    }
                

                    else
                    {
                        s = temp_words[1];
                    }

                }

                s+=' ';

            }
            return city;
        }
    }
}
